index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Introduction to Haskell</title>
<meta name="author" content="(Tim McIver)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/dist/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Introduction to Haskell</h1><h2 class="author">Tim McIver</h2>
</section>

<section>
<section id="slide-org77d0096">
<h2 id="org77d0096">What is Haskell?</h2>
<div class="outline-text-2" id="text-org77d0096">
</div>
</section>
<section id="slide-org2f140bb">
<h3 id="org2f140bb">Haskell is a programming language that is</h3>
<ul>
<li class="fragment roll-in">pure</li>
<li class="fragment roll-in">lazy</li>
<li class="fragment roll-in">strongly typed</li>
<li class="fragment roll-in">immutable</li>
<li class="fragment roll-in">used to build programs by composing functions</li>

</ul>

</section>
<section id="slide-org7b51a4f">
<h3 id="org7b51a4f">First, Something Familiar</h3>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>$ cat world.txt
I see trees of green
Red roses too
I see them bloom
For me and for you
And I think to myself
What a wonderful world
</code></pre>
</div>
<div class="org-src-container">

<pre  class="src src-bash"><code trim>$ cat world.txt | sort | head -n 3
And I think to myself
For me and for you
I see them bloom
</code></pre>
</div>

</section>
<section id="slide-orgf0b32ad">
<h3 id="orgf0b32ad">In Haskell</h3>
<div class="org-src-container">

<pre  class="fragment roll-in"><code trim><span style="color: #fce94f;">main</span> <span style="color: #fcaf3e;">=</span> readFile <span style="color: #e9b96e;">"world.txt"</span> <span style="color: #fcaf3e;">&gt;&gt;=</span> putStr <span style="color: #fcaf3e;">.</span> sortTake3

<span style="color: #fce94f;">sortTake3</span> s <span style="color: #fcaf3e;">=</span> unlines (take 3 (sort (lines s)))
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orge8352ab">
<h2 id="orge8352ab">Function Composition</h2>
<div class="outline-text-2" id="text-orge8352ab">
</div>
</section>
<section id="slide-org6711d5e">
<h3 id="org6711d5e"></h3>
<p>
Compose two functions using '.'
</p>
<pre  class="example">
f (g x) = (f . g) x
</pre>

<div class="fragment roll-in block">
<p>
So
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">sortTake3</span> s <span style="color: #fcaf3e;">=</span> unlines (take 3 (sort (lines s)))
</code></pre>
</div>

</div>

<div class="fragment roll-in block">
<p>
becomes
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">sortTake3</span> s <span style="color: #fcaf3e;">=</span> (unlines <span style="color: #fcaf3e;">.</span> take 3 <span style="color: #fcaf3e;">.</span> sort <span style="color: #fcaf3e;">.</span> lines) s
</code></pre>
</div>

</div>

<div class="fragment roll-in block">
<p>
which can be written as
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">sortTake3</span> <span style="color: #fcaf3e;">=</span> unlines <span style="color: #fcaf3e;">.</span> take 3 <span style="color: #fcaf3e;">.</span> sort <span style="color: #fcaf3e;">.</span> lines
</code></pre>
</div>

</div>

</section>
<section id="slide-orgf9a9e6c">
<h3 id="orgf9a9e6c">Some Other Functions</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">take3Sort</span>    <span style="color: #fcaf3e;">=</span> unlines <span style="color: #fcaf3e;">.</span> sort <span style="color: #fcaf3e;">.</span> take 3 <span style="color: #fcaf3e;">.</span> lines
<span style="color: #fce94f;">reverseLines</span> <span style="color: #fcaf3e;">=</span> unlines <span style="color: #fcaf3e;">.</span> reverse       <span style="color: #fcaf3e;">.</span> lines
<span style="color: #fce94f;">dropLines</span> n  <span style="color: #fcaf3e;">=</span> unlines <span style="color: #fcaf3e;">.</span> drop n        <span style="color: #fcaf3e;">.</span> lines
</code></pre>
</div>

<p class="fragment roll-in">
See a pattern here?
</p>


</section>
</section>
<section>
<section id="slide-org1a00f71">
<h2 id="org1a00f71">Higher Order Functions</h2>
<div class="outline-text-2" id="text-org1a00f71">
</div>
</section>
<section id="slide-org9a8878c">
<h3 id="org9a8878c"></h3>
<p>
Let's abstract the pattern.
</p>

<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">forLines</span> f <span style="color: #fcaf3e;">=</span> unlines <span style="color: #fcaf3e;">.</span> f <span style="color: #fcaf3e;">.</span> lines
</code></pre>
</div>

<div class="fragment roll-in BLOCK">
<p>
Then we can write the previous functions as
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">sortTake3</span>    <span style="color: #fcaf3e;">=</span> forLines (take 3 <span style="color: #fcaf3e;">.</span> sort)
<span style="color: #fce94f;">take3Sort</span>    <span style="color: #fcaf3e;">=</span> forLines (sort <span style="color: #fcaf3e;">.</span> take 3)
<span style="color: #fce94f;">reverseLines</span> <span style="color: #fcaf3e;">=</span> forLines reverse
<span style="color: #fce94f;">dropLines</span> n  <span style="color: #fcaf3e;">=</span> forLines (drop n)
</code></pre>
</div>

</div>

<p class="fragment roll-in">
<code>forLines</code> is a higher-order function because it accepts a function as argument.
</p>

</section>
<section id="slide-orge077acd">
<h3 id="orge077acd">Defining Functions</h3>
<div class="fragment roll-in BLOCK">
<p>
Let's define a function that indents a <code>String</code> by some number of spaces.
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">indent</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">Int</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>
<span style="color: #fce94f;">indent</span> n s <span style="color: #fcaf3e;">=</span> replicate n <span style="color: #e9b96e;">' '</span> <span style="color: #fcaf3e;">++</span> s
</code></pre>
</div>

</div>

<div class="fragment roll-in BLOCK">
<p>
But we can't use it with <code>forLines</code> like this
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">indentLines</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">String</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>
<span style="color: #fce94f;">indentLines</span> <span style="color: #fcaf3e;">=</span> forLines indent
</code></pre>
</div>

</div>

<p class="fragment roll-in">
Why not?
</p>

</section>
<section id="slide-org1c11ec3">
<h3 id="org1c11ec3"></h3>
<p>
Let's fix it.  Create another higher-order function that operates on each line.
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">forEachLine</span> <span style="color: #fcaf3e;">::</span> (<span style="color: #8cc4ff;">String</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>) <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>
<span style="color: #fce94f;">forEachLine</span> f <span style="color: #fcaf3e;">=</span> unlines <span style="color: #fcaf3e;">.</span> map f <span style="color: #fcaf3e;">.</span> lines
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgcc88c98">
<h2 id="orgcc88c98">Haskell Lists</h2>
<div class="outline-text-2" id="text-orgcc88c98">
</div>
</section>
<section id="slide-org452e82a">
<h3 id="org452e82a"></h3>
<p>
You can create lists
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">ints</span> <span style="color: #fcaf3e;">=</span> [2, 3, 4]
<span style="color: #fce94f;">strs</span> <span style="color: #fcaf3e;">=</span> [<span style="color: #e9b96e;">"how "</span>, <span style="color: #e9b96e;">"you "</span>, <span style="color: #e9b96e;">"doin?"</span>]
</code></pre>
</div>

<div class="fragment roll-in BLOCK">
<p>
And you can
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #73d216;">-- </span><span style="color: #73d216;">map over them</span>
<span style="color: #fce94f;">map</span> (<span style="color: #fcaf3e;">+</span>1) ints <span style="color: #73d216;">-- </span><span style="color: #73d216;">[3, 4, 5]</span>

<span style="color: #73d216;">-- </span><span style="color: #73d216;">reverse them</span>
<span style="color: #fce94f;">reverse</span> ints <span style="color: #73d216;">-- </span><span style="color: #73d216;">[4, 3, 2]</span>

<span style="color: #73d216;">-- </span><span style="color: #73d216;">fold them</span>
<span style="color: #fce94f;">foldl</span> (<span style="color: #fcaf3e;">+</span>) 0 ints <span style="color: #73d216;">-- </span><span style="color: #73d216;">9</span>
<span style="color: #fce94f;">foldl</span> (<span style="color: #fcaf3e;">*</span>) 1 ints <span style="color: #73d216;">-- </span><span style="color: #73d216;">24</span>
<span style="color: #fce94f;">foldl</span> (<span style="color: #fcaf3e;">++</span>) <span style="color: #e9b96e;">""</span> strs <span style="color: #73d216;">-- </span><span style="color: #73d216;">"how you doin?"</span>
</code></pre>
</div>

</div>

<p class="fragment roll-in">
And much more!
</p>

</section>
<section id="slide-org6734322">
<h3 id="org6734322">Infinite Lists</h3>
<p>
You can create infinite lists
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">xs</span> <span style="color: #fcaf3e;">=</span> [1<span style="color: #fcaf3e;">..</span>] <span style="color: #73d216;">-- </span><span style="color: #73d216;">[1, 2, 3, 4, ...]</span>
</code></pre>
</div>

<div class="fragment roll-in BLOCK">
<p>
You can operate on them normally
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim>(take 3 <span style="color: #fcaf3e;">.</span> drop 2) xs <span style="color: #73d216;">-- </span><span style="color: #73d216;">[3, 4, 5]</span>
</code></pre>
</div>

</div>

<p class="fragment roll-in">
(Just don't try to consume it all!)
</p>

<p class="fragment roll-in">
You can make any recursive data structure infinite (e.g. trees)
</p>

</section>
<section id="slide-org236ea1c">
<h3 id="org236ea1c">Accessing List Elements</h3>
<p>
You can
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #73d216;">--  </span><span style="color: #73d216;">get the head of a list</span>
<span style="color: #fce94f;">head</span> strs <span style="color: #73d216;">-- </span><span style="color: #73d216;">"how"</span>

<span style="color: #73d216;">-- </span><span style="color: #73d216;">get the "rest" of a list</span>
<span style="color: #fce94f;">tail</span> strs <span style="color: #73d216;">-- </span><span style="color: #73d216;">["you ", "doin?"]</span>

<span style="color: #73d216;">--  </span><span style="color: #73d216;">get an element</span>
<span style="color: #fce94f;">strs</span> <span style="color: #fce94f;">!!</span> 1 <span style="color: #73d216;">-- </span><span style="color: #73d216;">"you"</span>
</code></pre>
</div>

<p class="fragment roll-in">
But what happens if you try to get the head of an empty list?
</p>
<div class="org-src-container">

<pre  class="fragment roll-in"><code trim><span style="color: #fce94f;">head</span> <span style="color: #8cc4ff;">[]</span> <span style="color: #73d216;">-- </span><span style="color: #73d216;">boom! exception</span>
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgc446fdf">
<h2 id="orgc446fdf">Functions Revisited: Partial/Total Functions</h2>
<div class="outline-text-2" id="text-orgc446fdf">
</div>
</section>
<section id="slide-org7e7f063">
<h3 id="org7e7f063"></h3>
<p>
<code>head</code> is known as a <span class="underline">partial</span> function: it does not return a value for all inputs.
</p>

<p class="fragment roll-in">
Conversely, a <span class="underline">total</span> function is one the does return a value for all combination of inputs.
</p>

<p class="fragment roll-in">
It's a best practice to use total functions when possible.
</p>

</section>
</section>
<section>
<section id="slide-org5829b5c">
<h2 id="org5829b5c">Maybe</h2>
<div class="outline-text-2" id="text-org5829b5c">
</div>
</section>
<section id="slide-org7d12033">
<h3 id="org7d12033"></h3>
<p>
<code>Maybe</code> is Haskell's answer to the null problem.
</p>
<div class="fragment roll-in BLOCK">
<p>
(It's a <a href="https://en.wikipedia.org/wiki/Tony_Hoare#Apologies_and_retractions">billion dollar mistake</a>, you know.)
</p>

</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">Maybe</span> a <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Just</span> a
             <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Nothing</span>
</code></pre>
</div>

<div class="fragment roll-in BLOCK">
<p>
<code>head</code> is defined something like
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">head</span> <span style="color: #fcaf3e;">::</span> [a] <span style="color: #fcaf3e;">-&gt;</span> a
<span style="color: #fce94f;">head</span> <span style="color: #8cc4ff;">[]</span> <span style="color: #fcaf3e;">=</span> error <span style="color: #e9b96e;">"empty list"</span>
<span style="color: #fce94f;">head</span> (x<span style="color: #8cc4ff;">:</span><span style="color: #b4fa70;">_</span>) <span style="color: #fcaf3e;">=</span> x
</code></pre>
</div>

</div>

<div class="fragment roll-in BLOCK">
<p>
A version using <code>Maybe</code> would look something like
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">headMaybe</span> <span style="color: #fcaf3e;">::</span> [a] <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">Maybe</span> a
<span style="color: #fce94f;">head</span> <span style="color: #8cc4ff;">[]</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Nothing</span>
<span style="color: #fce94f;">head</span> (x<span style="color: #8cc4ff;">:</span><span style="color: #b4fa70;">_</span>) <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Just</span> x
</code></pre>
</div>

</div>

</section>
<section id="slide-org13e07de">
<h3 id="org13e07de">Haskell is Pure</h3>
<ul>
<li class="fragment roll-in">This means that functions <span class="underline">always</span> return the same output for a given set of inputs, and</li>
<li class="fragment roll-in">they have no side effects</li>

</ul>

</section>
<section id="slide-org9b4b575">
<h3 id="org9b4b575">Haskell is lazy</h3>
<ul>
<li class="fragment roll-in">data is only created as it is needed</li>

</ul>

</section>
<section id="slide-org18f482c">
<h4 id="org18f482c"><span class="todo TODO">TODO</span> perhaps show definition of Fibonacci sequence as in <a href="https://www.youtube.com/watch?v=apBWkBDVlow">this video</a>.</h4>
<div class="org-src-container">

<pre  class="fragment roll-in"><code trim><span style="color: #73d216;">-- </span><span style="color: #73d216;">an infinite list</span>
<span style="color: #fce94f;">xs</span> <span style="color: #fcaf3e;">=</span> [1<span style="color: #fcaf3e;">..</span>]

<span style="color: #73d216;">-- </span><span style="color: #73d216;">take the first 10</span>
<span style="color: #fce94f;">take</span> 10 xs
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org6590c11">
<h2 id="org6590c11">Why Haskell is Cool</h2>
<ul>
<li>A new way to think about programming</li>
<li>expressive, concise and clear</li>
<li>beautiful</li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
